Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
import pandas as pd

data = [4, 8, 15, 16, 23, 42]
series = pd.Series(data)
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [3]:
list = [1,4,25,52.63,"shubh","kumar",89,65.56,57,23]
s = pd.Series(list)
print(s)

0        1
1        4
2       25
3    52.63
4    shubh
5    kumar
6       89
7    65.56
8       57
9       23
dtype: object

Q3. Create a Pandas DataFrame that contains the following data:

Then, print the DataFrame.

In [4]:
gd = {
    'Name': ['Alice','Bob','Claire'],
    'Age': [25,30,27],
    'Gender': ['Female','Male','Female']
}

df = pd.DataFrame(gd)
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [11]:
'''DataFrame: The Pandas DataFrame is a two-dimensional data structure composed of columns and rows. You can think of the DataFrame as similar to a CSV or relational database table.
It is different from pandas series because Pandas Series data structure is a one-dimensional labelled array. It is the primary building block for a DataFrame, making up its rows and columns.'''


# Creating a DataFrame

data1 = {
    'Name': ['Alice', 'Bob', 'Claire'],
    'Age': [25, 30, 27],
    'Gender': ['Female', 'Male', 'Female']
}

df1 = pd.DataFrame(data1)
print("DataFrame:")
print(df1)
print()

# Creating a Series

name_series = df1['Name']
print("Series:")
print(name_series)

DataFrame:
     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Series:
0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Here are some common functions we can use to manipulate data in a Pandas DataFrame:

1. Read Data : We can read data in pandas data frame as read_csv(). Two most used data read formats are csv and excel.

2. Head and Tail : To see the data frame we can use df.head(). Head returns the first rows, if no input is given it will always show above 5 rows. In contrast to see below rows, we can use df.tail().

3. Shape, Size and Info:  Two most basic functions after reading data is to know the number of rows and columns, and to know the datatype of variables. We can use df.shape, it gives a total number of rows and then columns. df.size() returns the number of rows times number of columns in the data frame. We can also use df.info(), from that we get different information such as rows from RangeIndex, Data columns and then data type of each column. It also includes the information of non-null counts.

4. isna : if one needs to get the total number of null values in a data, we can use df.isna()

5. Describe : To understand basic statistics of variables we can use df.describe(). It will give you count, mean, standard deviation, and also 5 number summary.

6. Nunique : To get the total unique values of variables, we can use df.nunique(). It will give all the unique values a variable contains.

7. Value Count : to get the unique values of a single variable, we can use df.__________.value_counts().

8. If we make any changes in the data and want to write it to a comma-separated values (csv) file, we can use to_csv(). In this for index default is true. We can use df.to_csv("data.csv") .

In [18]:
# Read Data
df2 = pd.read_csv("heart_failure_clinical_records_dataset.csv")

In [19]:
# Type of dataframe
type(df2)

pandas.core.frame.DataFrame

In [20]:
df2.columns

Index(['age', 'anaemia', 'creatinine_phosphokinase', 'diabetes',
       'ejection_fraction', 'high_blood_pressure', 'platelets',
       'serum_creatinine', 'serum_sodium', 'sex', 'smoking', 'time',
       'DEATH_EVENT'],
      dtype='object')

In [21]:
df2.head(3)

,age,anaemia,creatinine_phosphokinase,diabetes,ejection_fraction,high_blood_pressure,platelets,serum_creatinine,serum_sodium,sex,smoking,time,DEATH_EVENT
0,75.0,0,582,0,20,1,265000.00,1.9,130,1,0,4,1
1,55.0,0,7861,0,38,0,263358.03,1.1,136,1,0,6,1
2,65.0,0,146,0,20,0,162000.00,1.3,129,1,1,7,1

In [22]:
df2.tail(3)

,age,anaemia,creatinine_phosphokinase,diabetes,ejection_fraction,high_blood_pressure,platelets,serum_creatinine,serum_sodium,sex,smoking,time,DEATH_EVENT
296,45.0,0,2060,1,60,0,742000.0,0.8,138,0,0,278,0
297,45.0,0,2413,0,38,0,140000.0,1.4,140,1,1,280,0
298,50.0,0,196,0,45,0,395000.0,1.6,136,1,1,285,0

In [24]:
df2.shape

(299, 13)

In [26]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 299 entries, 0 to 298
Data columns (total 13 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   age                       299 non-null    float64
 1   anaemia                   299 non-null    int64
 2   creatinine_phosphokinase  299 non-null    int64
 3   diabetes                  299 non-null    int64
 4   ejection_fraction         299 non-null    int64
 5   high_blood_pressure       299 non-null    int64
 6   platelets                 299 non-null    float64
 7   serum_creatinine          299 non-null    float64
 8   serum_sodium              299 non-null    int64
 9   sex                       299 non-null    int64
 10  smoking                   299 non-null    int64
 11  time                      299 non-null    int64
 12  DEATH_EVENT               299 non-null    int64
dtypes: float64(3), int64(10)
memory usage: 30.5 KB

In [27]:
df2.describe()

,age,anaemia,creatinine_phosphokinase,diabetes,ejection_fraction,high_blood_pressure,platelets,serum_creatinine,serum_sodium,sex,smoking,time,DEATH_EVENT
count,299.000000,299.000000,299.000000,299.000000,299.000000,299.000000,299.000000,299.00000,299.000000,299.000000,299.00000,299.000000,299.00000
mean,60.833893,0.431438,581.839465,0.418060,38.083612,0.351171,263358.029264,1.39388,136.625418,0.648829,0.32107,130.260870,0.32107
std,11.894809,0.496107,970.287881,0.494067,11.834841,0.478136,97804.236869,1.03451,4.412477,0.478136,0.46767,77.614208,0.46767
min,40.000000,0.000000,23.000000,0.000000,14.000000,0.000000,25100.000000,0.50000,113.000000,0.000000,0.00000,4.000000,0.00000
25%,51.000000,0.000000,116.500000,0.000000,30.000000,0.000000,212500.000000,0.90000,134.000000,0.000000,0.00000,73.000000,0.00000
50%,60.000000,0.000000,250.000000,0.000000,38.000000,0.000000,262000.000000,1.10000,137.000000,1.000000,0.00000,115.000000,0.00000
75%,70.000000,1.000000,582.000000,1.000000,45.000000,1.000000,303500.000000,1.40000,140.000000,1.000000,1.00000,203.000000,1.00000
max,95.000000,1.000000,7861.000000,1.000000,80.000000,1.000000,850000.000000,9.40000,148.000000,1.000000,1.00000,285.000000,1.00000

In [28]:
df2.nunique()

age                          47
anaemia                       2
creatinine_phosphokinase    208
diabetes                      2
ejection_fraction            17
high_blood_pressure           2
platelets                   176
serum_creatinine             40
serum_sodium                 27
sex                           2
smoking                       2
time                        148
DEATH_EVENT                   2
dtype: int64

In [32]:
print(df2.anaemia.value_counts())

0    170
1    129
Name: anaemia, dtype: int64

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

A6. Series and DataFrame objects in Pandas are mutable in nature. This means that you can modify their values, add or remove rows or columns, and perform various data manipulations on them.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [33]:
# Create Series for Name, Age, and City
names = pd.Series(['Amar', 'Akbar', 'Anthony'])
ages = pd.Series([30, 22, 35])
cities = pd.Series(['Patna', 'Hyderabad', 'Kerala'])

# Create a DataFrame using the Series
data2 = {'Name': names, 'Age': ages, 'City': cities}
df4 = pd.DataFrame(data2)

# Print the DataFrame
print(df4)

      Name  Age       City
0     Amar   30      Patna
1    Akbar   22  Hyderabad
2  Anthony   35     Kerala